app/Controllers/Auth.php

    public function attemptLogin()
{
    $session = session();

    // Ambil input dari form
    $login    = $this->request->getPost('login'); // bisa email atau username
    $password = $this->request->getPost('password');

    // Cari user berdasarkan email atau username
    $user = $this->userModel
        ->groupStart()
            ->where('email', $login)
            ->orWhere('username', $login)
        ->groupEnd()
        ->first();
---
SELECT *
FROM `users`
WHERE   (
`email` = 'syamsi'
OR `username` = 'syamsi'
 )
 LIMIT 1