app/Controllers/Home.php

  public function index(): string
  {
    $keuangan = new KeuanganModel();
    $data = ['data' => $keuangan->findAll()];
---
SELECT *
FROM `keuangan`

    public function info()
    {
        $request = service('request');

        $dari = $request->getGet('dari');
        $sampai = $request->getGet('sampai');
        $unit = $request->getGet('unit');

        $builder = $this->keuanganModel->orderBy('tanggal', 'DESC');

        if ($dari && $sampai) {
            $builder->where("tanggal >=", $dari)->where("tanggal <=", $sampai);
        } elseif ($dari) {
            $builder->where("tanggal >=", $dari);
        } elseif ($sampai) {
            $builder->where("tanggal <=", $sampai);
        }

        if ($unit) {
            $builder->where('unit', $unit);
        }

        $data = $builder->findAll(50); // batas tampilkan 50 data terbaru
---
SELECT *
FROM `keuangan`
ORDER BY `tanggal` DESC
 LIMIT 50

  public function barang()
  {
    $barang = new BarangModel();

    $data = [
      'data' => $barang->orderBy('jenis', 'desc')->findAll(),
    ];
---
SELECT *
FROM `barang`
ORDER BY `jenis` DESC

      public function update()
    {
        $id = $this->request->getPost('id');
        $this->keuanganModel->update($id, [
            'catatan' => $this->request->getPost('catatan'),
            'keterangan' => $this->request->getPost('keterangan'),
            'nominal' => $this->request->getPost('nominal'),
            'unit' => $this->request->getPost('unit'),
            'tanggal' => $this->request->getPost('tanggal'),
            'bukti' => $this->request->getPost('bukti'),
        ]);
---
UPDATE `keuangan` SET `catatan` = 'Pengeluaran', `keterangan` = 'Claim vendor', `nominal` = '5598500', `unit` = 'kantin', `tanggal` = '2025-09-01', `bukti` = ''
WHERE `keuangan`.`id` IN ('360')