app/Controllers/InvoiceController.php

    public function getData()
    {
        $invoices = $this->invoiceModel->findAll();
---
SELECT *
FROM `invoices`