app/Controllers/Laporan.php

    public function index()
    {
        // Aset
        $totalAset = $this->asetModel->selectSum('nilai')->first()['nilai'] ?? 0;

        // Barang
        $totalBarang = $this->barangModel->countAllResults();

        // Invoice
        $totalInvoice = $this->invoiceModel->countAllResults();
        $tagihan      = $this->invoiceModel->selectSum('total_tagihan')->first()['total_tagihan'] ?? 0;

        // Pembayaran invoice (total sudah dibayar)
        $dibayar = 0;
        $allInvoice = $this->invoiceModel->findAll();
---
SELECT SUM(`nilai`) AS `nilai`
FROM `aset`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT COUNT(*) AS `numrows`
FROM `invoices`
SELECT SUM(`total_tagihan`) AS `total_tagihan`
FROM `invoices`
 LIMIT 1
SELECT *
FROM `invoices`