app/Controllers/Pembiayaan.php

SELECT *
FROM `pembiayaan`
---
    public function index()
    {
        $dataPembiayaan = $this->pembiayaan->findAll();

INSERT INTO `pembiayaan` (`customer`, `modalKeluar`, `hargaJual`, `tanggalAngsuran`, `jatuhTempo`) VALUES ('asd', '5000000', '6000000', '2012-12-12', '2021-12-12')
---
    public function store()
    {
        $this->pembiayaan->save([
            'customer' => $this->request->getPost('customer'),
            'modalKeluar' => $this->request->getPost('modalKeluar'),
            'hargaJual' => $this->request->getPost('hargaJual'),
            'tanggalAngsuran' => $this->request->getPost('tanggalAngsuran'),
            'jatuhTempo' => $this->request->getPost('jatuhTempo')
        ]);