app/Models/KeuanganModel.php

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'kantin'
AND `catatan` = 'pemasukan'
 LIMIT 1
---
    public function labaKantin()
    {
        return $this->where('unit', 'kantin')->where('catatan', 'pemasukan')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'laundry'
AND `catatan` = 'pemasukan'
 LIMIT 1
---
    public function labaLaundry()
    {
        return $this->where('unit', 'laundry')->where('catatan', 'pemasukan')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'pembiayaan'
AND `catatan` = 'pemasukan'
 LIMIT 1
---
    public function labaPembiayaan()
    {
        return $this->where('unit', 'pembiayaan')->where('catatan', 'pemasukan')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'kantin'
AND `catatan` = 'pengeluaran'
 LIMIT 1
---
    public function rugiKantin()
    {
        return $this->where('unit', 'kantin')->where('catatan', 'pengeluaran')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'laundry'
AND `catatan` = 'pengeluaran'
 LIMIT 1
---
    public function rugiLaundry()
    {
        return $this->where('unit', 'laundry')->where('catatan', 'pengeluaran')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `unit` = 'pembiayaan'
AND `catatan` = 'pengeluaran'
 LIMIT 1
---
    public function rugiPembiayaan()
    {
        return $this->where('unit', 'pembiayaan')->where('catatan', 'pengeluaran')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `catatan` = 'pemasukan'
 LIMIT 1
---
    public function omset()
    {
        return $this->where('catatan', 'pemasukan')->selectSum('nominal')->first()['nominal'] ?? 0;

SELECT SUM(`nominal`) AS `nominal`
FROM `keuangan`
WHERE `catatan` = 'pengeluaran'
 LIMIT 1
---
    public function biaya()
    {
        return $this->where('catatan', 'pengeluaran')->selectSum('nominal')->first()['nominal'] ?? 0;