app/Models/PaymentModel.php

    public function getTotalBayar($id_invoice)
    {
        return $this->db->table('payment_allocations')
            ->selectSum('jumlah_dialok')
            ->where('id_invoice', $id_invoice)
            ->get()
            ->getRow('jumlah_dialok') ?? 0;
---
SELECT SUM(`jumlah_dialok`) AS `jumlah_dialok`
FROM `payment_allocations`
WHERE `id_invoice` = '1'