app/Models/SakuImportModel.php

    public function getLatest()
    {
        return $this->orderBy('tanggal', 'DESC')->first();
---
SELECT *
FROM `saku_import`
ORDER BY `tanggal` DESC
 LIMIT 1